#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
random_password.flyte_db_password: Refreshing state... [id=none]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
google_container_node_pool.flyte_nodepool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster/nodePools/flyte-node-pool]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_container_cluster.flyte_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster]
data.google_client_config.default: Reading...
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
data.google_client_config.default: Read complete after 0s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.flyte_cluster must be replaced
-/+ resource "google_container_cluster" "flyte_cluster" {
      ~ cluster_ipv4_cidr           = "10.12.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      ~ default_max_pods_per_node   = 110 -> (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "35.185.88.208" -> (known after apply)
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster" -> (known after apply)
      - initial_node_count          = 1 -> null # forces replacement
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ location                    = "us-east1" -> "us-east1-a" # forces replacement
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "flyte-cluster"
      ~ network                     = "projects/exemplary-tide-379122/global/networks/default" -> "default"
      ~ networking_mode             = "VPC_NATIVE" -> (known after apply)
      ~ node_locations              = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.16.0.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (6 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      ~ ip_allocation_policy {
          ~ cluster_ipv4_cidr_block       = "10.12.0.0/14" -> (known after apply)
          ~ cluster_secondary_range_name  = "gke-flyte-cluster-pods-e9ac082c" -> (known after apply)
          ~ services_ipv4_cidr_block      = "10.16.0.0/20" -> (known after apply)
          ~ services_secondary_range_name = "gke-flyte-cluster-services-e9ac082c" -> (known after apply)
            # (1 unchanged attribute hidden)

          - pod_cidr_overprovision_config {
              - disabled = false -> null
            }
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRR3JIdUNjdGhPajNmbFpzelo3aG54VEFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSa01tSmpaamM0TmkweU5ERTBMVFExWXpBdE9XTmtaaTB3WldFNU9EQTRaVFptWTJVdwpJQmNOTWpNd056RXlNVE0wT0RBM1doZ1BNakExTXpBM01EUXhORFE0TURkYU1DOHhMVEFyQmdOVkJBTVRKR1F5ClltTm1OemcyTFRJME1UUXRORFZqTUMwNVkyUm1MVEJsWVRrNE1EaGxObVpqWlRDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQUxQQ05CYStkWTJ3K0RzcFpHU25pSE1xUXBlTU9Wc1ViVW9nbUZYcwp2VzNNenBBUlNkcGVWN3pTWnMvY3ExNjR0aDlLVW5FYThnUDJLeVJYbzltU0FDMW1qSlo0ZmpPclBQMGJIaDhZCm43Qmc1SWJvSmlGVmM3aHJOd3psWmNZV2l5TVVPMEtxb3lNLzFrbGhwVXp2c0ZDcllLaC8xbEFzdldPM2s3azAKUENmMEg4cndWbm5DaGNicnJMeEJnOUdTWHFkNWI5RUcvZGJpRjlldGgraEEyNWIzYmMwVjIxWU5seGNwV2dOZApHUTdUa3JubG1qaWx3bHN3TWw2NHFVOHoxc2xPS0dZZnVKbjZ5bkMvNzVuR3JVZmtMVmR4b2kwYi9NV053MVRzCnkra2lla1l6b1ZNbjlCdmlhQ1paU0IydUJLUVBBU20wTkZLQXV2VklPVGN2SGcrUlRYUWE3NDlncnBmZFVvUHMKbit6T0k4bkJ2clEyTGg3NjE5VUZGaGpwZ1JKRTY2Nno5WnB5RUI4bWlJc0dlYzVqS3ora2RJYThoNWVuelg2RgpPWVE1VkZicVRjSThmSzZ2VjFCZzRSaFFDRlJINTNvb2RNVjlack9hcTdiRmV1UU9nUEt2aU1QMk5Hakk1TjJUCncwVk1KNUJCUmIxYlFBTnI3ZHJEbHN1RDd3SURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVVwSE1qYzgyM1lGWkJLcW53cGFWRzRidFhXOWd3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFHamFFVE1UZkk5ckJlQmN5dUJ4RThTRmdweU5KdnI0QnNQeE1HZ2pmM0hmCkUzM2VtRDV1alpVcm1tUW4ramI5L3dBVGtkZDA5bm1aVmtITXpSSHlSb0JtbVlheTU2Q29WZEhWeklJVS9rSWoKSWxMeXdoZHhDY1RlSjFZUFBRdko4c0t2RzdnZHVoZEk3YzdSMzBTS2VRdlBjOEV1WUwwWVkvL1RsQXpDRHRxWQpxVWdhVTJuY1RheGlFQXl0Tm5VTGkwZjF5eCtVcTRPY3AvTzRqQjFWL0t5VkJwOTRSM3duUUVmQlJlY2Z1Qlh4CnFBV0tlbmFwMWJTbTVQMFdLYnFmMG5pM1NxT0dWUm9mTGZ6bjFyYTBqMlVESXpqMGFGeGRMQ0c1Ynk5MkV2UjUKNGJhdVN5SUJJVnRYRzJIZmFmY0JZNGNaSHVXb1hiRFFIaGpiWDU3OGcvam5BZm95S3JIQS9wNytaaFpDVHI5dwp6TmtkWGNUQmhjUEszNytoS2JCVGM0aUI4WVU1Nzk5Z2hmTFZGMXU1UU93YmpQeUNseDRkY1JQenREL0tabkdvCkpZWUNhTmVlMTRqQjFKRFlsZGlUZ2dqWVlOM1ZPMnI4RWxFUHdibllzbGhwcm9FOVh1Q2NRcDBzdWwxL3dxZWYKNEp2RE9LT2ZwbUhsRGlwZlpCUGNtdz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

            # (1 unchanged block hidden)
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      + node_config { # forces replacement
          + disk_size_gb      = 10 # forces replacement
          + disk_type         = "pd-balanced" # forces replacement
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false # forces replacement
          + service_account   = (known after apply)
          + spot              = false # forces replacement
          + taint             = (known after apply)

          + ephemeral_storage_local_ssd_config { # forces replacement
              + local_ssd_count = 0 # forces replacement
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.0.22" -> null
          - public_endpoint         = "35.185.88.208" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_node_pool.flyte_node_pool will be created
  + resource "google_container_node_pool" "flyte_node_pool" {
      + cluster                     = "flyte-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "flyte-np"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = 10
          + disk_type         = "pd-balanced"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-micro"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)

          + ephemeral_storage_local_ssd_config {
              + local_ssd_count = 0
            }
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*